Статистика работы механизмов/Конфигурация/DataProcessors/_ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АнкетыФизическихЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АнкетаФизическогоЛица</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.АнкетаФизическогоЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ЭкспортКонтактнойИнформацииФизЛицВБухгалтерию/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Экспорт контактной информации физ. лиц в Бухгалтерию",
		"0.08",
		"",
		Истина,
		"");
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЭкспортКонтактнойИнформации", "Экспорт контактной информации",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	// заполним параметры команды (вариативности команд здесь нет)
	ПараметрыКоманды = Неопределено;
	Если НЕ ПараметрыОбработки.Свойство("ПараметрыКоманды", ПараметрыКоманды) Тогда
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);	
		
	Если ИдентификаторКоманды = "ЭкспортКонтактнойИнформации" Тогда
		Если ПараметрыКоманды.Свойство("МассивАнкет") Тогда
			МассивАнкет = ПараметрыКоманды.МассивАнкет;
		Иначе
			МассивАнкет = Новый Массив;
			МассивАнкет.Добавить(ПараметрыКоманды.АнкетаФизическогоЛица);
		КонецЕсли;
		
		ЭкспортКонтактнойИнформации(МассивАнкет);
		
		ОповеститьОбОшибках();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьМетод(ИдентификаторКоманды, Экземпляры) Экспорт
	
	Если ИдентификаторКоманды = "ЭкспортКонтактнойИнформации" Тогда
		
		МассивАнкет = Новый Массив;

		Для Каждого ТекЭкземпляр Из Экземпляры Цикл
			МассивАнкет.Добавить(ТекЭкземпляр.Параметры.АнкетаФизическогоЛица);
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	АнкетаФизическогоЛица.Организация КАК Организация,
			|	АнкетаФизическогоЛица.Ссылка КАК Анкета
			|ИЗ
			|	Документ.АнкетаФизическогоЛица КАК АнкетаФизическогоЛица
			|ГДЕ
			|	АнкетаФизическогоЛица.Ссылка В(&МассивАнкет)
			|ИТОГИ ПО
			|	Организация";
		
		Запрос.УстановитьПараметр("МассивАнкет", МассивАнкет);
		
		ВыборкаОрганизаций = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизаций.Следующий() Цикл
			
			ЕстьОшибки = Ложь;
			ТекстОшибки = "";
			
			ЭтотОбъект.Организация = ВыборкаОрганизаций.Организация;
			
			МассивАнкетОрганизации = Новый Массив;
			
			Выборка = ВыборкаОрганизаций.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивАнкетОрганизации.Добавить(Выборка.Анкета);
			КонецЦикла;
		
			ЭкспортКонтактнойИнформации(МассивАнкетОрганизации, ЕстьОшибки, ТекстОшибки);
			
			Для Каждого ТекЭкземпляр Из Экземпляры Цикл
				Если МассивАнкетОрганизации.Найти(ТекЭкземпляр.Параметры.АнкетаФизическогоЛица) <> Неопределено Тогда
					РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(ТекЭкземпляр.Идентификатор, ЕстьОшибки, ТекстОшибки);
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЭкспортКонтактнойИнформации(МассивАнкет, ЕстьОшибки = Ложь, ТекстОшибки = "") Экспорт
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		 ЭтотОбъект.ДополнительныеСвойства.Ошибки.Очистить();
	КонецЕсли;
	
	Если МассивАнкет.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	МассивДанных = ПолучитьКонтакнуюИнформацию(МассивАнкет);
	
	ЭкспортДанных(МассивДанных, ЕстьОшибки, ТекстОшибки);
	
КонецПроцедуры

Функция ПолучитьКонтакнуюИнформацию(МассивАнкет)
	
	МассивДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АнкетаФизическогоЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК IDMX,
		|	АнкетаФизическогоЛица.EMail КАК Email,
		|	АнкетаФизическогоЛица.ТелефонДляОповещения КАК Phone
		|ИЗ
		|	Документ.АнкетаФизическогоЛица КАК АнкетаФизическогоЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО АнкетаФизическогоЛица.ЮрФизЛицо = КодыВоВнешнихСистемахСрезПоследних.Объект
		|ГДЕ
		|	АнкетаФизическогоЛица.Ссылка В(&МассивАнкет)
		|	И (АнкетаФизическогоЛица.EMail <> """"
		|			ИЛИ АнкетаФизическогоЛица.ТелефонДляОповещения <> """")";
	
	Запрос.УстановитьПараметр("МассивАнкет"	, МассивАнкет);
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.IDMX) Тогда
			ЗарегистрироватьОшибку("Для физ. лица '" + Выборка.ЮрФизЛицо + "' не задан код матрикс");	
			Продолжить;
		КонецЕсли;
		
		ЭлементДанных = Новый Структура("IDMX, Email, Phone");	
		ЭлементДанных.IDMX = Выборка.IDMX;
		
		Если ЗначениеЗаполнено(Выборка.Phone) И РаботаСКонтактнойИнформациейКлиентСервер.ПроверкаТелефонаДляОповещения(Выборка.Phone, "") Тогда
			ЭлементДанных.Phone = Выборка.Phone;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Email) И Сред(Выборка.Email, 2, 1) <> "@" Тогда //если второй символ @, то в поле будет что-то вроде "-@mail.ru"
			ЭлементДанных.Email = Выборка.Email;
		КонецЕсли;
		
		МассивДанных.Добавить(ЭлементДанных);	
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Процедура ЭкспортДанных(МассивДанных, ЕстьОшибки, ТекстОшибки)
	
	Бухгалтерия = РаботаСВнешнимиСистемами.ПолучитьCOMСоединениеСБухгалтерией(ЭтотОбъект.Организация);
	Если Бухгалтерия = Неопределено Тогда
		ТекстОшибки = "Ошибка подключения к бухгалтерской базе! "; 
		ЗарегистрироватьОшибку(ТекстОшибки);
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
	МассивCOM = Бухгалтерия.NewObject("Массив");
	Для Каждого ЭлементДанных Из МассивДанных Цикл
		МассивCOM.Добавить(ЭлементДанных);
	КонецЦикла;
	
	Если НЕ Бухгалтерия.Region_ОбщегоНазначения.ПринятьДанныеКонтрагентов(МассивCOM, ТекстОшибки) Тогда
		ЕстьОшибки = Истина;
		ЗарегистрироватьОшибку(ТекстОшибки);
	КонецЕсли;
	
	Бухгалтерия = "";
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки)=Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках()
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = СтрСоединить(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС);
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОшибках

#Область СверкаДанных

//Функция ПолучитьТаблицуАвтоТестов()
//	
//	ТаблицаАвтоТестов = Новый ТаблицаЗначений;
//	
//	ТаблицаАвтоТестов.Колонки.Добавить("ИмяТеста"				, Новый ОписаниеТипов("Строка"));
//	ТаблицаАвтоТестов.Колонки.Добавить("ВыполнятьПоУмолчанию"	, Новый ОписаниеТипов("Булево"));
//	ТаблицаАвтоТестов.Колонки.Добавить("ИмяФункции"				, Новый ОписаниеТипов("Строка"));
//	ТаблицаАвтоТестов.Колонки.Добавить("ЕстьРасшифровка"		, Новый ОписаниеТипов("Булево"));
//	
//	Возврат ТаблицаАвтоТестов;
//	
//КонецФункции

//Процедура СписокАвтоТестов(ТаблицаАвтоТестов) Экспорт
//	
//	АвтоТест = ТаблицаАвтоТестов.Добавить();
//	АвтоТест.ИмяТеста				= "Контактная информация ИИС выгружена в бухгалтерию";
//	АвтоТест.ВыполнятьПоУмолчанию	= Истина;
//	АвтоТест.ИмяФункции				= "КонтактнаяИнформацияФизиковВыгруженаВБухгалтерию";
//	АвтоТест.ЕстьРасшифровка		= Истина;

//КонецПроцедуры

Функция КонтактнаяИнформацияФизиковВыгруженаВБухгалтерию(Результат = Неопределено) Экспорт
	
	Период = ТекущаяДата();
	
	Если Результат <> Неопределено Тогда 
		Результат.Очистить();
		
		Макет = ПолучитьМакет("РасхожденияСБухгалтерией");
		
		ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
		ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	КонецЕсли;
	
	Бухгалтерия = РаботаСВнешнимиСистемами.ПолучитьCOMСоединениеСБухгалтерией(ЭтотОбъект.Организация);
	Если Бухгалтерия = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка подключения к бухгалтерской базе!"); 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail КАК ЕМайл,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ТелефонДляОповещения КАК Телефон,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК КодМатрикс
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(&Период, ) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = КодыВоВнешнихСистемахСрезПоследних.Объект
		|			И (КодыВоВнешнихСистемахСрезПоследних.ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих))
		|			И (КодыВоВнешнихСистемахСрезПоследних.ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления.Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|ГДЕ
		|	((ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail, 1, 1) <> """"
		|		И ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.EMail, 2, 1) <> ""@"")
		|			ИЛИ ПОДСТРОКА(РеквизитыФизическихЛицАнкетныеСрезПоследних.ТелефонДляОповещения, 1, 1) <> """")";
	
	Запрос.УстановитьПараметр("Организация"	, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период"		, Период);
	
	КодыМатрикс = Новый Соответствие;
	
	КвалификаторСтроки	= Бухгалтерия.NewObject("КвалификаторыСтроки", "100");
	ОписаниеТипов		= Бухгалтерия.NewObject("ОписаниеТипов", "Строка", КвалификаторСтроки);
	
	КонтактнаяИнформация = Бухгалтерия.NewObject("ТаблицаЗначений");
	КонтактнаяИнформация.Колонки.Добавить("Представление"	, ОписаниеТипов);
	КонтактнаяИнформация.Колонки.Добавить("КодМатрикс"		, ОписаниеТипов);
	КонтактнаяИнформация.Колонки.Добавить("ЕМайл"			, ОписаниеТипов);
	КонтактнаяИнформация.Колонки.Добавить("Телефон"			, ОписаниеТипов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаКонтактнойИнформации = КонтактнаяИнформация.Добавить();
		
		НоваяСтрокаКонтактнойИнформации.Представление	= Строка(Выборка.ЮрФизЛицо);
		НоваяСтрокаКонтактнойИнформации.КодМатрикс		= Выборка.КодМатрикс;
		НоваяСтрокаКонтактнойИнформации.ЕМайл			= ?(Сред(Выборка.ЕМайл, 2, 1) = "@" ИЛИ Найти(Выборка.ЕМайл, "@") = 0, "", Выборка.ЕМайл);
		НоваяСтрокаКонтактнойИнформации.Телефон			= Выборка.Телефон;
		
		КодыМатрикс.Вставить(Выборка.КодМатрикс, Выборка.ЮрФизЛицо);
	КонецЦикла;
	
	ЗапросБух = Бухгалтерия.NewObject("Запрос");
	ЗапросБух.УстановитьПараметр("Период"					, Период);
	ЗапросБух.УстановитьПараметр("КонтактнаяИнформацияУФО"	, КонтактнаяИнформация);
	
	ЗапросБух.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(_КонтактнаяИнформация.Представление КАК СТРОКА(100)) КАК Представление,
		|	ВЫРАЗИТЬ(_КонтактнаяИнформация.КодМатрикс КАК СТРОКА(100)) КАК КодМатрикс,
		|	ВЫРАЗИТЬ(_КонтактнаяИнформация.ЕМайл КАК СТРОКА(250)) КАК ЕМайл,
		|	ВЫРАЗИТЬ(_КонтактнаяИнформация.Телефон КАК СТРОКА(250)) КАК Телефон
		|ПОМЕСТИТЬ _КонтактнаяИнформацияУФО
		|ИЗ
		|	&КонтактнаяИнформацияУФО КАК _КонтактнаяИнформация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Region_СоответствиеССистемамиСрезПоследних.ИД КАК ИД,
		|	ЕМайл.Представление КАК ЕМайл,
		|	Телефон.Представление КАК Телефон
		|ПОМЕСТИТЬ _КонтактнаяИнформацияБух
		|ИЗ
		|	РегистрСведений.Region_СоответствиеССистемами.СрезПоследних(
		|			&Период,
		|			Система.Код = ""MX1""
		|				И ИД В
		|					(ВЫБРАТЬ
		|						_КонтактнаяИнформацияУФО.КодМатрикс
		|					ИЗ
		|						_КонтактнаяИнформацияУФО КАК _КонтактнаяИнформацияУФО)) КАК Region_СоответствиеССистемамиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ЕМайл
		|		ПО (ЕМайл.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагенты))
		|			И (ЕМайл.Ссылка = Region_СоответствиеССистемамиСрезПоследних.Объект)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК Телефон
		|		ПО (Телефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
		|			И (Телефон.Ссылка = Region_СоответствиеССистемамиСрезПоследних.Объект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КонтактнаяИнформацияУФО.Представление КАК Представление,
		|	_КонтактнаяИнформацияУФО.КодМатрикс КАК КодМатрикс,
		|	""E-mail"" КАК ВидКонтактнойИнформации,
		|	_КонтактнаяИнформацияУФО.ЕМайл КАК ЗначениеУФО,
		|	_КонтактнаяИнформацияБух.ЕМайл КАК ЗначениеБух
		|ИЗ
		|	_КонтактнаяИнформацияУФО КАК _КонтактнаяИнформацияУФО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КонтактнаяИнформацияБух КАК _КонтактнаяИнформацияБух
		|		ПО _КонтактнаяИнформацияУФО.КодМатрикс = _КонтактнаяИнформацияБух.ИД
		|			И ISNULL(_КонтактнаяИнформацияБух.ЕМайл, """") <> ISNULL(_КонтактнаяИнформацияУФО.ЕМайл, """")
		|			
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_КонтактнаяИнформацияУФО.Представление,
		|	_КонтактнаяИнформацияУФО.КодМатрикс,
		|	""Телефон"",
		|	_КонтактнаяИнформацияУФО.Телефон,
		|	_КонтактнаяИнформацияБух.Телефон
		|ИЗ
		|	_КонтактнаяИнформацияУФО КАК _КонтактнаяИнформацияУФО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КонтактнаяИнформацияБух КАК _КонтактнаяИнформацияБух
		|		ПО _КонтактнаяИнформацияУФО.КодМатрикс = _КонтактнаяИнформацияБух.ИД
		|			И ISNULL(_КонтактнаяИнформацияБух.Телефон, """") <> ISNULL(_КонтактнаяИнформацияУФО.Телефон, """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Представление";
	
	РезультатЗапросаБух = ЗапросБух.Выполнить();
	Если НЕ РезультатЗапросаБух.Пустой() И Результат <> Неопределено Тогда
		Результат.Вывести(ОбластьШапка);
		
		ВыборкаБух = РезультатЗапросаБух.Выбрать();
		Пока ВыборкаБух.Следующий() Цикл
			ОбластьСтрока.Параметры.ЮрФизЛицо				= КодыМатрикс.Получить(СокрЛП(ВыборкаБух.КодМатрикс));
			ОбластьСтрока.Параметры.ВидКонтактнойИнформации = ВыборкаБух.ВидКонтактнойИнформации; 
			ОбластьСтрока.Параметры.ЗначениеУФО				= СокрЛП(ВыборкаБух.ЗначениеУФО); 
			ОбластьСтрока.Параметры.ЗначениеБух				= СокрЛП(ВыборкаБух.ЗначениеБух); 			
			
			Результат.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Бухгалтерия = "";
	
	Возврат РезультатЗапросаБух.Пустой();
	
КонецФункции
	
#КонецОбласти


ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
